////////////////////////////////////////////////////////////////////////////////
//  ActivityPane.as
//  2008.01.30, created by gslim
//
//  ============================================================================
//  Copyright (C) 2007-2008 ManInSoft Corp.
//  All Rights Reserved. 
////////////////////////////////////////////////////////////////////////////////

package com.maninsoft.smart.modeler.xpdl.components
{
	import mx.core.UIComponent;

	/**
	 * 다이어그램의 액티비티 목록을 표시/수정/삭제 한다.
	 */
	public class ActivityPane extends UIComponent {
		
		//----------------------------------------------------------------------
		// Variables
		//----------------------------------------------------------------------


		//----------------------------------------------------------------------
		// Initialization & Finalization
		//----------------------------------------------------------------------
		
		/** Constructor */
		public function ActivityPane()	{
			super();
		}
		
	}
}