////////////////////////////////////////////////////////////////////////////////
//  RootNode.as
//  2007.12.15, created by gslim
//
//  ============================================================================
//  Copyright (C) 2007-2008 ManInSoft Corp.
//  All Rights Reserved. 
////////////////////////////////////////////////////////////////////////////////

package com.maninsoft.smart.modeler.model
{
	/**
	 * 다이어그램 전체를 차지하는 개념적인 노드
	 * 다이어그램의 모든 노드들은 이 노드로부터 계층적으로 표현된다.
	 */
	public class RootNode extends Node {

		//----------------------------------------------------------------------
		// Variables
		//----------------------------------------------------------------------

		/** Storage for owner */
		private var _owner: Diagram;


		//----------------------------------------------------------------------
		// Initialization
		//----------------------------------------------------------------------
		
		public function RootNode(owner: Diagram) {
			super();
			
			_owner = owner;
		}


		//----------------------------------------------------------------------
		// Properties
		//----------------------------------------------------------------------
		
		/**
		 * owner
		 */
		public function get owner(): Diagram {
			return _owner;
		}
	}
}